app/views/profiles/show.html.erb

SELECT  "wedding_requests".* FROM "wedding_requests"  WHERE "wedding_requests"."sender_id" = 1 AND "wedding_requests"."reciever_id" = 1  ORDER BY "wedding_requests"."id" ASC LIMIT 1
---
	  <p class="pull-center">
	  <% wq =WeddingRequest.where(:sender_id=>current_user.id, :reciever_id=>@user.id).first  %>

SELECT "pictures".* FROM "pictures"  WHERE "pictures"."user_id" = ?  [["user_id", 1]]
---
    </div>
    <% @user.pictures.each do |x|%>