app/views/wedding_requests/index.html.erb

      <tr>
        <td><%= link_to  User.find(wedding_request.sender_id).first_name, profile_path(wedding_request.sender_id) %> </td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1