app/controllers/home_controller.rb

  def index
  	if current_user
  		if !current_user.is_completed
  			redirect_to register_profile_path(current_user)
  		end


	  	gender = current_user.gender == "Male" ? "Female" : "Male"
      @all_recents = User.where(:gender=>gender).size
      @all_matches = User.where(:gender=>gender).size
	  	@recents = User.where(:gender=>gender).order('created_at DESC').limit(6)
---
SELECT COUNT(*) FROM "users"  WHERE "users"."gender" = 'Male'
SELECT  "users".* FROM "users"  WHERE "users"."gender" = 'Male'  ORDER BY created_at DESC LIMIT 6