app/controllers/matches_controller.rb

  def index
  	gender = current_user.gender == "Male" ? "Female" : "Male"
  	@matches = User.where(:gender=>gender)
---
SELECT "users".* FROM "users"  WHERE "users"."gender" = 'Female'