app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
 def create

    @picture = Picture.new(picture_params)
    @picture.user_id  = current_user.id
    respond_to do |format|
      if @picture.save