app/controllers/profiles_controller.rb

UPDATE "users" SET "annual_income" = ?, "avatar_content_type" = ?, "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "body_type" = ?, "community" = ?, "diet" = ?, "dob" = ?, "drink" = ?, "education_level" = ?, "height" = ?, "is_completed" = ?, "living_in" = ?, "marital_status" = ?, "mobile_no" = ?, "more_info" = ?, "mother_tongue" = ?, "occupation" = ?, "profile_id" = ?, "religion" = ?, "skin_tone" = ?, "smoke" = ?, "state" = ?, "updated_at" = ? WHERE "users"."id" = 2
---
  def update
    respond_to do |format|
        @user.is_completed = true
      if @user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 6  ORDER BY "users"."id" ASC LIMIT 1
---
    def set_user
      if @user = User.find(params[:id])