app/controllers/successes_controller.rb

def create
    @success = Success.new(success_params)
    #puts patient_params
    @success.user_id = current_user.id
   if @success.save
---
INSERT INTO "successes" ("created_at", "marriage_date", "name", "story", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-12-08 05:38:39.205780"], ["marriage_date", "2014-12-08"], ["name", "Mrs.Monisai"], ["story", "tjxhngfhjykuk"], ["updated_at", "2014-12-08 05:38:39.205780"], ["user_id", 3]]

  def edit
    @success=Success.find(params[:id])
---
SELECT  "successes".* FROM "successes"  WHERE "successes"."id" = ? LIMIT 1  [["id", 1]]

  def show
  @successes =Success.find(params[:id])
---
SELECT  "successes".* FROM "successes"  WHERE "successes"."id" = ? LIMIT 1  [["id", 1]]

def index
    @successes = Success.all
---
SELECT "successes".* FROM "successes"

def update
  @success = Success.find(params[:id])
    respond_to do |format|
      if @success.update(success_params)
---
SELECT  "successes".* FROM "successes"  WHERE "successes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "successes" SET "name" = ?, "updated_at" = ? WHERE "successes"."id" = 1  [["name", "Jenisrikanth"], ["updated_at", "2014-12-08 08:09:16.339185"]]