app/controllers/wedding_requests_controller.rb

SELECT  "wedding_requests".* FROM "wedding_requests"  WHERE "wedding_requests"."sender_id" = 3 AND "wedding_requests"."reciever_id" = 2  ORDER BY "wedding_requests"."id" ASC LIMIT 1
INSERT INTO "wedding_requests" ("created_at", "is_accepted", "reciever_id", "sender_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-08 07:03:33.528671"], ["is_accepted", "t"], ["reciever_id", 3], ["sender_id", 2], ["updated_at", "2014-12-08 07:03:33.528671"]]
---
  def create
    @wedding_request = WeddingRequest.new(wedding_request_params)

      already =  WeddingRequest.where(:sender_id=>@wedding_request.sender_id, :reciever_id=>@wedding_request.reciever_id).first
      if !already
        if @wedding_request.save

UPDATE "wedding_requests" SET "is_accepted" = ?, "updated_at" = ? WHERE "wedding_requests"."id" = 1  [["is_accepted", "t"], ["updated_at", "2014-12-08 07:06:06.969548"]]
---
  def accept
     @wedding_request.is_accepted = true
     @wedding_request.save

SELECT  "wedding_requests".* FROM "wedding_requests"  WHERE "wedding_requests"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_wedding_request
      @wedding_request = WeddingRequest.find(params[:id])